---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.UseLoadsDisplayScaling
source: html/77cc2234-172a-e52c-9c98-067f81843a57.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.UseLoadsDisplayScaling Property

Whether to use loads display scaling. If disabled then loads are displayed according to force scale type parameters.

## Syntax (C#)
```csharp
public bool UseLoadsDisplayScaling { get; set; }
```